In [1]:
import pandas as pd

In [2]:
asian_df = pd.read_csv('Resources/asian.csv')
black_df = pd.read_csv('Resources/black.csv')
white_df = pd.read_csv('Resources/white.csv')
latino_df = pd.read_csv('Resources/latino.csv')

In [3]:
ab_df = pd.merge(asian_df, black_df, on='DATE', how='right')
ab_df.head()

       DATE  Rate_Asian  Rate_Black
0  1/1/2000         4.0         8.2
1  2/1/2000         3.4         8.1
2  3/1/2000         4.1         7.4
3  4/1/2000         3.1         7.0
4  5/1/2000         3.5         7.7

In [4]:
abw_df = pd.merge(ab_df, white_df, on='DATE', how='right')
abw_df.head()

       DATE  Rate_Asian  Rate_Black  Rate_White
0  1/1/2000         4.0         8.2         3.4
1  2/1/2000         3.4         8.1         3.6
2  3/1/2000         4.1         7.4         3.5
3  4/1/2000         3.1         7.0         3.4
4  5/1/2000         3.5         7.7         3.5

In [5]:
race_df = pd.merge(abw_df, latino_df, on='DATE', how='right')
race_df.head()

       DATE  Rate_Asian  Rate_Black  Rate_White  Rate_Latino
0  1/1/2000         4.0         8.2         3.4          5.6
1  2/1/2000         3.4         8.1         3.6          5.7
2  3/1/2000         4.1         7.4         3.5          6.1
3  4/1/2000         3.1         7.0         3.4          5.5
4  5/1/2000         3.5         7.7         3.5          5.8

In [6]:
men_df = pd.read_csv('Resources/men_rate.csv')
women_df = pd.read_csv('Resources/women_rate.csv')

In [7]:
gender_df = pd.merge(men_df, women_df, on='DATE', how='right')
gender_df.head()

       DATE  Rate_Men  Rate_Women
0  1/1/2000       3.9         4.1
1  2/1/2000       4.1         4.1
2  3/1/2000       3.8         4.3
3  4/1/2000       3.7         4.0
4  5/1/2000       3.9         4.2

In [8]:
high_df = pd.read_csv('Resources/highschool.csv')
bachelors_df = pd.read_csv('Resources/bachelors.csv')
masters_df = pd.read_csv('Resources/masters.csv')
doctoral_df = pd.read_csv('Resources/doctorals.csv')

In [9]:
hb_df = pd.merge(high_df, bachelors_df, on='DATE', how='right')
hb_df.head()

       DATE  Rate_High_School  Rate_Bachelors
0  1/1/2000               3.4             1.8
1  2/1/2000               3.4             1.6
2  3/1/2000               3.3             1.7
3  4/1/2000               3.3             1.5
4  5/1/2000               3.4             1.6

In [10]:
hbm_df = pd.merge(hb_df, masters_df, on='DATE', how='right')
hbm_df.head()

       DATE  Rate_High_School  Rate_Bachelors  Rate_Masters
0  1/1/2000               3.4             1.8           1.6
1  2/1/2000               3.4             1.6           1.6
2  3/1/2000               3.3             1.7           1.7
3  4/1/2000               3.3             1.5           1.2
4  5/1/2000               3.4             1.6           1.0

In [11]:
education_df = pd.merge(hbm_df, doctoral_df, on='DATE', how='right')
education_df.head()

       DATE  Rate_High_School  Rate_Bachelors  Rate_Masters  Rate_Doctoral
0  1/1/2000               3.4             1.8           1.6            1.4
1  2/1/2000               3.4             1.6           1.6            1.4
2  3/1/2000               3.3             1.7           1.7            0.9
3  4/1/2000               3.3             1.5           1.2            0.6
4  5/1/2000               3.4             1.6           1.0            0.8

In [12]:
#race_df.to_csv('Resources/race.csv')

In [13]:
#gender_df.to_csv('Resources/gender.csv')

In [14]:
#education_df.to_csv('Resources/education.csv')

In [15]:
partial_df = pd.merge(education_df, gender_df, on='DATE', how='right')
partial_df.head()

,DATE,Rate_High_School,Rate_Bachelors,Rate_Masters,Rate_Doctoral,Rate_Men,Rate_Women
0,1/1/2000,3.4,1.8,1.6,1.4,3.9,4.1
1,2/1/2000,3.4,1.6,1.6,1.4,4.1,4.1
2,3/1/2000,3.3,1.7,1.7,0.9,3.8,4.3
3,4/1/2000,3.3,1.5,1.2,0.6,3.7,4.0
4,5/1/2000,3.4,1.6,1.0,0.8,3.9,4.2

In [16]:
partial2_df = pd.merge(partial_df, race_df, on='DATE', how='right')
partial2_df.head()

,DATE,Rate_High_School,Rate_Bachelors,Rate_Masters,Rate_Doctoral,Rate_Men,Rate_Women,Rate_Asian,Rate_Black,Rate_White,Rate_Latino
0,1/1/2000,3.4,1.8,1.6,1.4,3.9,4.1,4.0,8.2,3.4,5.6
1,2/1/2000,3.4,1.6,1.6,1.4,4.1,4.1,3.4,8.1,3.6,5.7
2,3/1/2000,3.3,1.7,1.7,0.9,3.8,4.3,4.1,7.4,3.5,6.1
3,4/1/2000,3.3,1.5,1.2,0.6,3.7,4.0,3.1,7.0,3.4,5.5
4,5/1/2000,3.4,1.6,1.0,0.8,3.9,4.2,3.5,7.7,3.5,5.8

In [17]:
overall_monthly_df = pd.read_csv('Resources/overall_monthly.csv')
overall_monthly_df.head()

       DATE  Rate_Overall
0  1/1/2000           4.0
1  2/1/2000           4.1
2  3/1/2000           4.0
3  4/1/2000           3.8
4  5/1/2000           4.0

In [18]:
full_df = pd.merge(partial2_df, overall_monthly_df, on='DATE', how='right')
full_df.head()

,DATE,Rate_High_School,Rate_Bachelors,Rate_Masters,Rate_Doctoral,Rate_Men,Rate_Women,Rate_Asian,Rate_Black,Rate_White,Rate_Latino,Rate_Overall
0,1/1/2000,3.4,1.8,1.6,1.4,3.9,4.1,4.0,8.2,3.4,5.6,4.0
1,2/1/2000,3.4,1.6,1.6,1.4,4.1,4.1,3.4,8.1,3.6,5.7,4.1
2,3/1/2000,3.3,1.7,1.7,0.9,3.8,4.3,4.1,7.4,3.5,6.1,4.0
3,4/1/2000,3.3,1.5,1.2,0.6,3.7,4.0,3.1,7.0,3.4,5.5,3.8
4,5/1/2000,3.4,1.6,1.0,0.8,3.9,4.2,3.5,7.7,3.5,5.8,4.0

In [19]:
full_df = full_df.set_index('DATE')
full_df.head()

,Rate_High_School,Rate_Bachelors,Rate_Masters,Rate_Doctoral,Rate_Men,Rate_Women,Rate_Asian,Rate_Black,Rate_White,Rate_Latino,Rate_Overall
DATE,,,,,,,,,,,
1/1/2000,3.4,1.8,1.6,1.4,3.9,4.1,4.0,8.2,3.4,5.6,4.0
2/1/2000,3.4,1.6,1.6,1.4,4.1,4.1,3.4,8.1,3.6,5.7,4.1
3/1/2000,3.3,1.7,1.7,0.9,3.8,4.3,4.1,7.4,3.5,6.1,4.0
4/1/2000,3.3,1.5,1.2,0.6,3.7,4.0,3.1,7.0,3.4,5.5,3.8
5/1/2000,3.4,1.6,1.0,0.8,3.9,4.2,3.5,7.7,3.5,5.8,4.0

In [20]:
full_df.to_csv('Resources/full.csv')